#### Current Property

---

|  |
| --- |
| PointIterator Class   See Also |

**Namespace:**   Autodesk.Revit.DB.PointClouds
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public virtual CloudPoint Current { get; } ``` |

| Visual Basic |
| --- |
| ``` Public Overridable ReadOnly Property Current As CloudPoint 	Get ``` |

| Visual C++ |
| --- |
| ``` public: virtual property CloudPoint Current { 	CloudPoint get (); } ``` |

#### Implements

 IEnumerator T Current

# See Also

PointIterator Class

Autodesk.Revit.DB.PointClouds Namespace